{
  "tr": {
    "header_name": "EDA ÖNCEL",
    "header_title": "Yönetim Bilişim Sistemleri",
    "about_h2": "HAKKIMDA",
    "about_p": "Yönetim Bilişim Sistemleri mezunu olarak, yazılım geliştirme ve veri yönetimi süreçlerine odaklanıyorum. Staj dönemimde MVC mimarisi kullanarak PHP ve SQL tabanlı web projeleri geliştirme, Fetch API ile asenkron veri yönetimi sağlama ve Google Colab/Ultralytics ile görüntü işleme modelleri eğitme konularında deneyim kazandım. Analitik düşünme yeteneğimi teknik becerilerimle birleştirerek, Full-stack geliştirme süreçlerinde ve inovatif projelerde aktif rol almayı hedefliyorum.",
    "edu_h2": "EĞİTİM",
    "edu_dept": "Yönetim Bilişim Sistemleri - Zeliha Tolunay Uygulamalı Teknoloji ve İşletmecilik Yüksekokulu",
    "edu_pedagogy": "Pedagojik Formasyon Eğitimi (Eğitim Fakültesi)",
    "exp_h2": "İŞ DENEYİMİ",
    "exp_1": "<b>Backend:</b> MVC (Model-View-Controller) yapısı kullanarak PHP tabanlı web uygulamalarının geliştirilmesinde aktif rol aldım.",
    "exp_2": "<b>Veritabanı Yönetimi:</b> SQL ile veritabanı şemalarının oluşturulması, veri çekme ve CRUD operasyonlarının optimizasyonu süreçlerini yürüttüm.",
    "exp_3": "<b>Frontend Geliştirme:</b> Kullanıcı arayüzlerinin modernizasyonu için CSS3 ve JavaScript kullanarak responsive tasarımlar uyguladım.",
    "exp_4": "<b>Yapay Zeka & Görüntü İşleme:</b> Google Colab ve Ultralytics Hub kullanarak görüntü işleme modelleri üzerinde çalıştım.",
    "exp_5": "<b>Model Eğitimi:</b> Veri setlerinin hazırlanması ve yapay zeka modellerinin eğitilmesi süreçlerini tamamlayarak sistemin doğruluk oranına katkı sağladım.",
    "cert_h2": "SERTİFİKALAR",
    "contact_h2": "İLETİŞİM",
    "skills_h2": "TEKNİK YETKİNLİKLER",
    "skills_db": "<b>Veri Tabanı:</b> SQL (MySQL / phpMyAdmin)",
    "skills_ai": "<b>Yapay Zeka:</b> Görüntü İşleme ve Model Eğitimi (YOLO)",
    "projects_h2": "PROJELERİM",
    "proj1_title": "Modern Portfolyo Sitesi",
    "proj2_title": "E-Ticaret Yönetim Sistemi",
    "proj1_modal_title": "Kişisel Portfolyo Web Sitesi",
    "proj1_desc": "Modern web teknolojileri (HTML5, CSS3, JavaScript) kullanarak geliştirdiğim bu projede, kişisel markamı ve teknik yetkinliklerimi sergileyen kullanıcı odaklı bir platform oluşturdum. Responsive (mobil uyumlu) tasarım ilkelerini temel alarak, projelerim, eğitim geçmişim ve iletişim bilgilerim gibi dinamik bölümleri optimize edilmiş bir kullanıcı deneyimi (UX) ile sundum. Kod yapısında temizlik ve sürdürülebilirlik prensiplerini uygulayarak, hem görsel hem de performans açısından yüksek standartlarda bir web arayüzü ortaya koydum.",
    "proj2_modal_title": "E-Ticaret Yönetim Paneli",
    "proj2_desc": "Veri yönetimi ve iş mantığı süreçlerini kapsayan, full-stack yaklaşımla geliştirilmiş bir e-ticaret uygulamasıdır. Proje kapsamında, SQL tabanlı ilişkisel veritabanı mimarisi üzerinde ürün, kategori ve stok yönetimini sağlayan kapsamlı bir Yönetici Paneli geliştirilerek tam fonksiyonel CRUD işlemleri hayata geçirilmiştir. Kullanıcı ve yönetici ayrımını sağlayan güvenli giriş sisteminin yanı sıra; ön yüz tarafında ürün listeleme, dinamik arama ve sepet yönetimi gibi e-ticaretin temel süreçlerini yöneten modüllerin geliştirme çalışmaları devam etmektedir. Bu proje ile karmaşık veri yapılarını yönetme ve backend-frontend entegrasyonu konularında yetkinliklerimi pekiştirdim.",
    "github_text": "<i class='fa-brands fa-github'></i> GitHub'da Kodları İncele",
    "lang_h2": "DİLLER",
    "lang_en_level": "İngilizce: A2",
    "ref_h2": "REFERANSLAR",
    "ref_pos1": "Kurumsal Müşteri Yöneticisi",
    "ref_pos2": "Takım Yöneticisi",
    "acc_h2": "HESAPLARIM",
    "download_btn": "<i class='fas fa-file-pdf'></i> PDF İndir",
    "qr_code": "Bağlantı kurmak için okutun."
  },
  "en": {
    "header_name": "EDA ÖNCEL",
    "header_title": "Management Information Systems",
    "about_h2": "ABOUT ME",
    "about_p": "As a Management Information Systems graduate, I focus on software development and data management processes. During my internship, I gained hands-on experience in developing PHP and SQL-based web projects using MVC architecture, managing asynchronous data with Fetch API, and training computer vision models using Google Colab and Ultralytics. By combining my analytical thinking skills with my technical expertise, I aim to take an active role in full-stack development processes and innovative projects.",
    "edu_h2": "EDUCATION",
    "edu_dept": "Management Information Systems - Zeliha Tolunay School of Applied Technology and Management",
    "edu_pedagogy": "Pedagogical Formation Training (Faculty of Education)",
    "exp_h2": "WORK EXPERIENCE",
    "exp_1": "<b>Backend:</b> Played an active role in developing PHP-based web applications using MVC (Model-View-Controller) architecture.",
    "exp_2": "<b>Database Management:</b> Conducted database schema creation, data retrieval, and CRUD operation optimization processes using SQL.",
    "exp_3": "<b>Frontend Development:</b> Implemented responsive designs using CSS3 and JavaScript for user interface modernization.",
    "exp_4": "<b>AI & Computer Vision:</b> Worked on computer vision models using Google Colab and Ultralytics Hub.",
    "exp_5": "<b>Model Training:</b> Completed the processes of preparing datasets and training AI models, contributing to the system's accuracy rate.",
    "cert_h2": "CERTIFICATIONS",
    "contact_h2": "CONTACT",
    "skills_h2": "TECHNICAL SKILLS",
    "skills_db": "<b>Database Management:</b> SQL (MySQL / phpMyAdmin)",
    "skills_ai": "<b>Artificial Intelligence:</b> Computer Vision and Model Training (YOLO)",
    "projects_h2": "PROJECTS",
    "proj1_title": "Modern Portfolio Site",
    "proj2_title": "E-Commerce Management System",
    "proj1_modal_title": "Personal Portfolio Website",
    "proj1_desc": "Developed using modern web technologies (HTML5, CSS3, and JavaScript), this project serves as a user-centric platform to showcase my professional brand and technical expertise. Built with responsive design principles at its core, the site provides an optimized user experience (UX) across all devices for sections including my projects, educational background, and contact information. By adhering to clean code and sustainability practices, I delivered a high-quality web interface that balances visual aesthetics with technical performance.",
    "proj2_modal_title": "E-Commerce Management Panel",
    "proj2_desc": "This is a full-stack e-commerce application designed to handle complex data management and business logic processes. Within the scope of the project, a comprehensive Admin Panel was developed on a SQL-based relational database architecture, implementing full CRUD (Create, Read, Update, Delete) functionality for product, category, and inventory management. In addition to a secure authentication system that differentiates between users and administrators, development is ongoing for front-end modules such as product listing, dynamic search, and shopping cart management. This project has significantly strengthened my skills in managing complex data structures and ensuring seamless backend-frontend integration.",
    "github_text": "<i class='fa-brands fa-github'></i> View Code on GitHub",
    "lang_h2": "LANGUAGES",
    "lang_en_level": "English: Elementary (A2)",
    "ref_h2": "REFERENCES",
    "ref_pos1": "Corporate Account Manager",
    "ref_pos2": "Team Manager",
    "acc_h2": "ACCOUNTS",
    "download_btn": "<i class='fas fa-file-pdf'></i> Download PDF",
    "qr_code": "Scan for all my links."
  }
}